Revit 2024 API
LeaderArray.Item Property
Gets or sets an item at a specified index within the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual Leader this[
	int index
] { get; set; }
Visual Basic
Public Overridable Property Item ( _
	index As Integer _
) As Leader
	Get
	Set
Visual C++
public:
virtual property Leader^ Item[int index] {
	Leader^ get (int index);
	void set (int index, Leader^ value);
}
Parameters
index
Type: System.Int32
The index of the item to be set or retrieved.
Return Value
Returns the object at the specified index.
See Also
LeaderArray Class
Autodesk.Revit.DB Namespace